import React from 'react'
import classes from './../../styles/global/global.module.scss'

const ContractView = () => {
    return (
        <div className={classes.container}>
            <div className={classes.container__pt}>
                <h2>Договор публичной оферты</h2>
                <h3>1. Общие положения</h3>
                <ol>
                    <li>
                        Настоящая оферта, является официальным предложением ФОП Василенко М.А., далее по тексту — «Продавец», заключить Договор купли-продажи товаров, услуг дистанционным способом, то есть через Интернет-магазин, далее по тексту — «Договор», и размещает Публичную оферту (предложение) на официальном интернет-сайте Продавца «https://mion.courses (далее - «Интернет-сайт»).
                    </li>
                    <li>
                        Моментом полного и безусловного принятия Покупателем предложения Продавца (акцептом) заключить электронный договор купли-продажи товаров, услуг, считается факт оплаты Покупателем заказа на условиях настоящего Договора, в сроки и по ценам, указанным на Интернет-сайте Продавца.
                    </li>
                </ol>
                <h3>2. Основные понятия</h3>
                <ol>
                    <li>
                        В настоящей оферте, если контекст не требует иного, нижеприведенные термины имеют следующие значения:
                    </li>                            
                </ol>
                <ul>
                    <li>«товар» - подписка, абонемент на урок;</li>
                    <li>«активный аккаунт» - аккаунт который не имеет ограничения в досутупе к контенту</li>
                    <li>«Интернет-магазин» - в соответствии с Законом Украины «об электронной коммерции», средство для представления или реализации товара, работы или услуги путем совершения электронной сделки.</li>
                    <li>«Продавец» - компания, реализующая товары, представленные на Интернет-сайте.</li>
                    <li>«Покупатель» - физическое лицо, заключившее с Продавцом Договор на условиях, изложенных ниже.</li>
                    <li>«Заказ» - выбор отдельных позиций из перечня товаров, указанных Покупателем при размещении заказа и проведении оплаты.</li>
                </ul>
                <h3>3. Предмет Договора</h3>
                <ol>
                    <li>Продавец обязуется передать в собственность Покупателя Товар, а Покупатель обязуется оплатить и принять Товар на условиях данного Договора.</li>
                </ol>
                <p>Настоящий Договор регулирует куплю-продажу товаров в Интернет-магазине, в том числе:</p>
                <ul>
                    <li>добровольный выбор Покупателем товаров в Интернет-магазине;</li>
                    <li>самостоятельное оформление Покупателем заказа в Интернет-магазине;</li>
                    <li>оплата Покупателем заказа, оформленного в Интернет-магазине;</li>
                    <li>добровольный выбор Покупателем товаров в Интернет-магазине;</li>
                </ul>
                <h3>4. Порядок оформления заказа</h3>
                <ol>
                    <li>
                        Покупатель имеет право оформить заказ на любой товар, представленный на Сайте Интернет-магазина и имеющийся в наличии.
                    </li>
                    <li>
                        После выборе необходимого товара - Покупатель переходит на страницу оплаты заказа
                    </li>
                </ol>
                <h3>5. Порядок оплаты заказа</h3>
                <ol>
                    <li>Покупатель оплачивает товар на странице оплаты заказа.</li>
                    <li>
                        После успешной оплаты Покупатель получает доступ к активному аккаунту либо если покупаются абонементы, получает досутуп к индивидуальным консультациям
                    </li>
                </ol>
                <h3>6. Условия доставки заказа</h3>
                <ol>
                    <li>Покупатель получает товар сразу после оплаты</li>
                    <li>После оплаты получает доступ к активному аккаунту</li>
                </ol>
                <h3>7. Права и обязанности сторон:</h3>
                <p>7.1. Продавец имеет право:</p>
                <ul>
                    <li>в одностороннем порядке приостановить оказание услуг по настоящему договору в случае нарушения Покупателем условий настоящего договора.</li>
                </ul>
                <p>7.2. Покупатель обязан:</p>
                <ul>
                    <li>своевременно оплатить и получить заказ на условиях настоящего договора.</li>
                </ul>
                <p>7.3. Покупатель имеет право:</p>
                <ul>
                    <li>оформить заказ в Интернет-магазине;</li>
                    <li>оформить электронный договор;</li>
                    <li>требовать от Продавца исполнения условий настоящего Договора.</li>
                </ul>

                <h3>8. Ответственность сторон</h3>
                <ol>
                    <li>
                        Стороны несут ответственность за невыполнение или ненадлежащее выполнение условий настоящего договора в порядке, предусмотренном этим договором и действующим законодательством Украины.
                    </li>
                    <li>
                        Продавец не несет ответственности за:
                        <ul>
                            <li>за содержание и правдивость информации, предоставляемой Покупателем при оформлении заказа;</li>
                            <li>за задержку и перебои в предоставлении Услуг (обработки заказа и доставке товара), которые происходят по причинам, находящимся вне сферы его контроля;</li>
                            <li>за противоправные незаконные действия, осуществленные Покупателем с помощью данного доступа к сети Интернет;</li>
                            <li>
                                за передачу Покупателем своих сетевых идентификаторов - IP, MAC-адреса, логина и пароля третьим лицам;
                            </li>
                        </ul>
                    </li>
                    <li>
                        Покупатель, используя предоставленный ему доступ к сети Интернет, самостоятельно несет ответственность за вред, причиненный его действиями (лично, даже если под его логином находилось другое лицо) лицам или их имуществу, юридическим лицам, государству или моральным принципам моральности.
                    </li>
                    <li>
                        В случае наступления обстоятельств непреодолимой силы, стороны освобождаются от выполнения условий этого договору. Под обстоятельствами непреодолимой силы для целей настоящего договора понимаются события, имеющие чрезвычайный, непредвиденный характер, которые исключают или объективно мешают исполнению настоящего договора, наступление которых Стороны не могли предвидеть и предотвратить разумными способами.
                    </li>
                    <li>
                        Стороны прикладывают максимум усилий для решения любых разногласий исключительно путем переговоров.
                    </li>
                </ol>
                <h3>9. Другие условия</h3>
                <ol>
                    <li>
                        Интернет-магазин оставляет за собой право в одностороннем порядке вносить изменения в настоящий договор при условии предварительной публикации его на сайте https://mion.courses
                    </li>
                    <li>
                        Интернет-магазин создан для организации дистанционного способа продажи товаров через Интернет.
                    </li>
                    <li>
                        Покупатель несет ответственность за достоверность указанной при оформлении заказа информации. При этом, при осуществлении акцепта (оформлении заказа и последующей оплаты товара) Покупатель предоставляет Продавцу свое безоговорочное согласие на сбор, обработку, хранение, использование своих персональных данных, в понимании ЗУ «О защите персональных данных».
                    </li>
                    <li>
                        Оплата Покупателем оформленного в Интернет-магазине заказа означает полное согласие Покупателя с условиями договора купли-продажи (публичной оферты)
                    </li>
                    <li>
                        Фактической датой электронного соглашения между сторонами есть дата принятия условий, в соответствии со ст. 11 Закона Украины «Об электронной коммерции»
                    </li>
                    <li>
                        Использование ресурса Интернет-магазина для предварительного просмотра товара, а также для оформления заказа для Покупателя есть бесплатным.
                    </li>
                    <li>
                        Информация, предоставляемая Покупателем является конфиденциальной. Интернет-магазин использует информацию о Покупателе исключительно в целях обработки заказа, отправления уведомлений Покупателю, доставки товара, осуществления взаиморасчетов и др.
                    </li>
                </ol>
                <h3>10. Заключительные положения</h3>
                <ol>
                    <li>
                        Возврат товара в Интернет-магазин производится согласно действующего законодательства Украины.
                    </li>
                    <li>
                        Возврат товара возможен при мотивированном объяснении в том, что контент не является ценным.
                    </li>
                    <li>
                        Возврат товара возможен в течении 24 часов возможен при случайной покупке товара родственником либо близким Покупателя
                    </li>
                    <li>
                            При возврате Покупателем товара надлежащего качества, Интернет-магазин возвращает ему уплаченную за товар денежную сумму по факту возврата товара за вычетом компенсации расходов Интернет-магазина связанных с комиссией.
                    </li>
                </ol>
                <h3>11. Срок действия договора</h3>
                <ol>
                    <li>
                        Электронный договор считается заключенным с момента получения лицом направившим предложение заключить такой договор, ответа о принятии этого предложения в порядке, определенном частью шестой статьи 11 Закона Украины "Об электронной коммерции".
                    </li>
                    <li>
                        До окончания срока действия этот Договор может быть расторгнут по взаимному согласию сторон до момента фактической доставки товара, путем возврата денежных средств
                    </li>
                    <li>
                        Стороны имеют право расторгнуть настоящий договор в одностороннем порядке, в случае невыполнения одной из сторон условий настоящего Договора и в случаях предусмотренных действующим законодательством Украины.
                    </li>
                </ol>
            </div>
        </div>
    )
}
export default ContractView